yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
	for(i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		faceBox = infFramebuf->results_FD[i];

		//resize face region image to input tensor
		image_t resizeImg;

		roi.x = faceBox.m_x0;
		roi.y = faceBox.m_y0;
		roi.w = faceBox.m_w;
		roi.h = faceBox.m_h;

		resizeImg.w = inputImgCols;
		resizeImg.h = inputImgRows;
		resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
		resizeImg.pixfmt = PIXFORMAT_RGB888;

		if(profiler)
			u64StartCycle = pmu_get_systick_Count();

        imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark resize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}
			
		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}
			
		/* face landmark/detection model preprocessing is image conversion from uint8 to [0,1] float values,
		* then quantize them with input quantization info. */
		for (size_t i = 0; i < inputTensor->bytes; i++)
		{
//			auto i_data_int8 = static_cast<int8_t>(((static_cast<float>(req_data[i]) / 255.0f) / inQuantParams.scale) + inQuantParams.offset);
//			signed_req_data[i] = std::min<int8_t>(INT8_MAX, std::max<int8_t>(i_data_int8, INT8_MIN));
			signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
		}

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		if(profiler){
			profiler->StartProfiling("Inference");
		}

		faceLandmarkModel->RunInference();

		if(profiler){
			profiler->StopProfiling();
			profiler->PrintProfilingResult();
		}

		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}

		postProcess->RunPostProcessing(
			inputImgCols,
			inputImgRows,
			roi.w,
			roi.h,
			modelOutput0,
			modelOutput1,
			modelOutput2,
			modelOutput3,
			infFramebuf->results_KP);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		/* Speaking detection: EMA smoothing + dual-threshold hysteresis + min duration */
		if (i < MAX_TRACKED_FACES && infFramebuf->results_KP.size() >= 468) {
			int matchedPrev = FindMatchingPrevFace(faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
			if (matchedPrev < 0 && infFramebuf->results_FD.size() == 1) {
				matchedPrev = (s_asPrevLipState[0].valid) ? 0 : -1;
			}

			/* Apply EMA smoothing - reduces jitter when face is static */
			ApplyLipSmoothing(infFramebuf->results_KP, matchedPrev, roi.x, roi.y, s_afSmoothedLipX, s_afSmoothedLipY);

			float lipVelocity = ComputeLipVelocity(s_afSmoothedLipX, s_afSmoothedLipY, matchedPrev);
			float mar = ComputeMAR(infFramebuf->results_KP, s_afSmoothedLipX, s_afSmoothedLipY, roi.x, roi.y);
			int storeIdx = (matchedPrev >= 0) ? matchedPrev : i;

			/* Dual-threshold hysteresis: ON thresholds vs OFF thresholds (dead zone prevents flicker) */
			int signalAboveOn  = (lipVelocity > SPEAKING_VELOCITY_THRESHOLD_ON) && (mar > SPEAKING_MAR_THRESHOLD_ON);
			int signalBelowOff = (lipVelocity < SPEAKING_VELOCITY_THRESHOLD_OFF) || (mar < SPEAKING_MAR_THRESHOLD_OFF);

			if (signalAboveOn) {
				s_i32SpeakingConfirmCount[i] = (s_i32SpeakingConfirmCount[i] < SPEAKING_SMOOTHING_FRAMES) ? s_i32SpeakingConfirmCount[i] + 1 : SPEAKING_SMOOTHING_FRAMES;
				s_i32SpeakingReleaseCount[i] = 0;
				if (s_i32SpeakingConfirmCount[i] >= SPEAKING_SMOOTHING_FRAMES) {
					infFramebuf->isSpeaking[i] = true;
				}
			} else if (infFramebuf->isSpeaking[i]) {
				s_i32SpeakingDurationCount[i]++;
				if (signalBelowOff) {
					s_i32SpeakingReleaseCount[i]++;
					/* Only release after: (a) below threshold for N frames, AND (b) min speaking duration elapsed */
					if (s_i32SpeakingReleaseCount[i] >= SPEAKING_RELEASE_FRAMES &&
						s_i32SpeakingDurationCount[i] >= SPEAKING_MIN_DURATION_FRAMES) {
						infFramebuf->isSpeaking[i] = false;
					}
				} else {
					s_i32SpeakingReleaseCount[i] = 0;
				}
				s_i32SpeakingConfirmCount[i] = 0;
			} else {
				s_i32SpeakingReleaseCount[i] = 0;
				s_i32SpeakingConfirmCount[i] = 0;
				s_i32SpeakingDurationCount[i] = 0;
			}
			if (!infFramebuf->isSpeaking[i]) {
				s_i32SpeakingDurationCount[i] = 0;
			}
			StoreLipPositions(s_afSmoothedLipX, s_afSmoothedLipY, storeIdx, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
		} else if (i < MAX_TRACKED_FACES) {
			s_asPrevLipState[i].valid = 0;
		}

		//Draw lip landmarks (smoothed - reduces on-screen jitter)
		if(infFramebuf->results_KP.size() >= 468)
		{
			if(profiler){
				u64StartCycle = pmu_get_systick_Count();
			}
			DrawLipLandmark(s_afSmoothedLipX, s_afSmoothedLipY, &infFramebuf->frameImage);

			if(profiler){
				u64EndCycle = pmu_get_systick_Count();
				info("draw face landmark cycles %llu \n", (u64EndCycle - u64StartCycle));
			}
		}
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}

	DrawDetectFace(infFramebuf->results_FD, infFramebuf->isSpeaking, &infFramebuf->frameImage);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("draw face region cycles %llu \n", (u64EndCycle - u64StartCycle));
	}
}

static int32_t PrepareModelToHyperRAM(void)
{
#define MODEL_FILE "0:\\face_landmark.tflite"
#define EACH_READ_SIZE 512
	
    TCHAR sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */	
    f_chdrive(sd_path);          /* set default path */

	int32_t i32FileSize;
	int32_t i32FileReadIndex = 0;
	int32_t i32Read;
	
	if(!ModelFileReader_Initialize(MODEL_FILE))
	{
        printf_err("Unable open model %s\n", MODEL_FILE);		
		return -1;
	}
	
	i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		i32FileReadIndex += i32Read;
	}
	
	if(i32FileReadIndex < i32FileSize)
	{
        printf_err("Read Model file size is not enough\n");		
		return -2;
	}
	
